<?xml version="1.0"?>
<net name="Accelera_Pipeline" version="10">
	<layers>
		<layer id="0" name="Input_0" type="INPUT" version="opset1" selected_in_path="true">
			<data/>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="standard_scaler_1" type="PREPROCESS" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="power_transform_2" type="PREPROCESS" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="clip_5" type="PREPROCESS" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="custom_9" type="MODEL" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="predict_20_1" type="PREDICT" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="f1_score_42" type="METRIC" version="opset1" selected_in_path="true">
			<data/>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0"/>
	</edges>
</net>
